input: "pool5"
input_dim: 200 
input_dim: 1
input_dim: 1
input_dim: 9216

input: "padding"
input_dim: 1
input_dim: 1
input_dim: 1
input_dim: 1

force_backward: true

layers {
  bottom: "pool5"
  bottom: "padding"
  top: "entropy"
  name: "entropy"
  type: ENTROPY_LOSS
}
