input: "pool5"
input_dim: 200
input_dim: 4096
input_dim: 1
input_dim: 1 

input: "num_padding"
input_dim: 1
input_dim: 1
input_dim: 1
input_dim: 1

force_backward: true

layers {
  bottom: "pool5"
  bottom: "num_padding"
  top: "prob"
  loss_weight: 1
  name: "softmax_back"
  type: SOFTMAX_BACK
}
